summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCpu_reg.h
/** Alias (User Manual Name) for CPU0_TR5_EVT.
* To use register names with standard convension, please use CPU0_TR5_EVT.
*/
#define	CPU0_TR5EVT	(CPU0_TR5_EVT)

/** \\brief  F034, Trigger Address */
#define CPU0_TR6_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F034u)

/** Alias (User Manual Name) for CPU0_TR6_ADR.
* To use register names with standard convension, please use CPU0_TR6_ADR.
*/
#define	CPU0_TR6ADR	(CPU0_TR6_ADR)

/** \\brief  F030, Trigger Event */
#define CPU0_TR6_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F030u)

/** Alias (User Manual Name) for CPU0_TR6_EVT.
* To use register names with standard convension, please use CPU0_TR6_EVT.
*/
#define	CPU0_TR6EVT	(CPU0_TR6_EVT)

/** \\brief  F03C, Trigger Address */
#define CPU0_TR7_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF881F03Cu)

/** Alias (User Manual Name) for CPU0_TR7_ADR.
* To use register names with standard convension, please use CPU0_TR7_ADR.
*/
#define	CPU0_TR7ADR	(CPU0_TR7_ADR)

/** \\brief  F038, Trigger Event */
#define CPU0_TR7_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF881F038u)

/** Alias (User Manual Name) for CPU0_TR7_EVT.
* To use register names with standard convension, please use CPU0_TR7_EVT.
*/
#define	CPU0_TR7EVT	(CPU0_TR7_EVT)

/** \\brief  FD30, CPU Trigger Address x */
#define CPU0_TRIG_ACC /*lint --e(923)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF881FD30u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu1
 * \{  */

/** \\brief  FF80, Address General Purpose Register */
#define CPU1_A0 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF80u)

/** \\brief  FF84, Address General Purpose Register */
#define CPU1_A1 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF84u)

/** \\brief  FFA8, Address General Purpose Register */
#define CPU1_A10 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFA8u)

/** \\brief  FFAC, Address General Purpose Register */
#define CPU1_A11 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFACu)

/** \\brief  FFB0, Address General Purpose Register */
#define CPU1_A12 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFB0u)

/** \\brief  FFB4, Address General Purpose Register */
#define CPU1_A13 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFB4u)

/** \\brief  FFB8, Address General Purpose Register */
#define CPU1_A14 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFB8u)

/** \\brief  FFBC, Address General Purpose Register */
#define CPU1_A15 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFBCu)

/** \\brief  FF88, Address General Purpose Register */
#define CPU1_A2 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF88u)

/** \\brief  FF8C, Address General Purpose Register */
#define CPU1_A3 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF8Cu)

/** \\brief  FF90, Address General Purpose Register */
#define CPU1_A4 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF90u)

/** \\brief  FF94, Address General Purpose Register */
#define CPU1_A5 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF94u)

/** \\brief  FF98, Address General Purpose Register */
#define CPU1_A6 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF98u)

/** \\brief  FF9C, Address General Purpose Register */
#define CPU1_A7 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FF9Cu)

/** \\brief  FFA0, Address General Purpose Register */
#define CPU1_A8 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFA0u)

/** \\brief  FFA4, Address General Purpose Register */
#define CPU1_A9 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF883FFA4u)

/** \\brief  FE20, Base Interrupt Vector Table Pointer */
#define CPU1_BIV /*lint --e(923)*/ (*(volatile Ifx_CPU_BIV*)0xF883FE20u)

/** \\brief  FE24, Base Trap Vector Table Pointer */
#define CPU1_BTV /*lint --e(923)*/ (*(volatile Ifx_CPU_BTV*)0xF883FE24u)

/** \\brief  FC04, CPU Clock Cycle Count */
#define CPU1_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF883FC04u)

/** \\brief  FC00, Counter Control */
#define CPU1_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF883FC00u)

/** \\brief  9400, Compatibility Control Register */
#define CPU1_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8839400u)

/** \\brief  FE1C, CPU Core Identification Register */
#define CPU1_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF883FE1Cu)

/** \\brief  D000, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D000u)

/** \\brief  D004, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D004u)

/** \\brief  D008, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D008u)

/** \\brief  D00C, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D00Cu)

/** \\brief  D010, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D010u)

/** \\brief  D014, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D014u)

/** \\brief  D018, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D018u)

/** \\brief  D01C, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D01Cu)

/** \\brief  D020, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D020u)

/** \\brief  D024, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR4_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D024u)

/** \\brief  D028, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR5_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D028u)

/** \\brief  D02C, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR5_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D02Cu)

/** \\brief  D030, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR6_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D030u)

/** \\brief  D034, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR6_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D034u)

/** \\brief  D038, CPU Code Protection Range Lower Bound Register */
#define CPU1_CPR7_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF883D038u)

