summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCpu_reg.h
/** \\brief  D03C, CPU Code Protection Range Upper Bound Register */
#define CPU1_CPR7_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF883D03Cu)

/** \\brief  FE18, CPU Identification Register TC1.6P */
#define CPU1_CPU_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CPU_ID*)0xF883FE18u)

/** \\brief  E000, CPU Code Protection Execute Enable Register Set */
#define CPU1_CPXE0 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF883E000u)

/** Alias (User Manual Name) for CPU1_CPXE0.
* To use register names with standard convension, please use CPU1_CPXE0.
*/
#define	CPU1_CPXE_0	(CPU1_CPXE0)

/** \\brief  E004, CPU Code Protection Execute Enable Register Set */
#define CPU1_CPXE1 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF883E004u)

/** Alias (User Manual Name) for CPU1_CPXE1.
* To use register names with standard convension, please use CPU1_CPXE1.
*/
#define	CPU1_CPXE_1	(CPU1_CPXE1)

/** \\brief  E008, CPU Code Protection Execute Enable Register Set */
#define CPU1_CPXE2 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF883E008u)

/** Alias (User Manual Name) for CPU1_CPXE2.
* To use register names with standard convension, please use CPU1_CPXE2.
*/
#define	CPU1_CPXE_2	(CPU1_CPXE2)

/** \\brief  E00C, CPU Code Protection Execute Enable Register Set */
#define CPU1_CPXE3 /*lint --e(923)*/ (*(volatile Ifx_CPU_CPXE*)0xF883E00Cu)

/** Alias (User Manual Name) for CPU1_CPXE3.
* To use register names with standard convension, please use CPU1_CPXE3.
*/
#define	CPU1_CPXE_3	(CPU1_CPXE3)

/** \\brief  FD0C, Core Register Access Event */
#define CPU1_CREVT /*lint --e(923)*/ (*(volatile Ifx_CPU_CREVT*)0xF883FD0Cu)

/** \\brief  FE50, CPU Customer ID register */
#define CPU1_CUS_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CUS_ID*)0xF883FE50u)

/** \\brief  FF00, Data General Purpose Register */
#define CPU1_D0 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF00u)

/** \\brief  FF04, Data General Purpose Register */
#define CPU1_D1 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF04u)

/** \\brief  FF28, Data General Purpose Register */
#define CPU1_D10 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF28u)

/** \\brief  FF2C, Data General Purpose Register */
#define CPU1_D11 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF2Cu)

/** \\brief  FF30, Data General Purpose Register */
#define CPU1_D12 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF30u)

/** \\brief  FF34, Data General Purpose Register */
#define CPU1_D13 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF34u)

/** \\brief  FF38, Data General Purpose Register */
#define CPU1_D14 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF38u)

/** \\brief  FF3C, Data General Purpose Register */
#define CPU1_D15 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF3Cu)

/** \\brief  FF08, Data General Purpose Register */
#define CPU1_D2 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF08u)

/** \\brief  FF0C, Data General Purpose Register */
#define CPU1_D3 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF0Cu)

/** \\brief  FF10, Data General Purpose Register */
#define CPU1_D4 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF10u)

/** \\brief  FF14, Data General Purpose Register */
#define CPU1_D5 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF14u)

/** \\brief  FF18, Data General Purpose Register */
#define CPU1_D6 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF18u)

/** \\brief  FF1C, Data General Purpose Register */
#define CPU1_D7 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF1Cu)

/** \\brief  FF20, Data General Purpose Register */
#define CPU1_D8 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF20u)

/** \\brief  FF24, Data General Purpose Register */
#define CPU1_D9 /*lint --e(923)*/ (*(volatile Ifx_CPU_D*)0xF883FF24u)

/** \\brief  9018, Data Asynchronous Trap Register */
#define CPU1_DATR /*lint --e(923)*/ (*(volatile Ifx_CPU_DATR*)0xF8839018u)

/** \\brief  FD00, Debug Status Register */
#define CPU1_DBGSR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGSR*)0xF883FD00u)

/** \\brief  FD48, Debug Trap Control Register */
#define CPU1_DBGTCR /*lint --e(923)*/ (*(volatile Ifx_CPU_DBGTCR*)0xF883FD48u)

/** \\brief  9040, Data Memory Control Register */
#define CPU1_DCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON0*)0xF8839040u)

/** \\brief  9000, Data Control Register 2 */
#define CPU1_DCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_DCON2*)0xF8839000u)

/** \\brief  FD44, CPU Debug Context Save Area Pointer */
#define CPU1_DCX /*lint --e(923)*/ (*(volatile Ifx_CPU_DCX*)0xF883FD44u)

/** \\brief  901C, Data Error Address Register */
#define CPU1_DEADD /*lint --e(923)*/ (*(volatile Ifx_CPU_DEADD*)0xF883901Cu)

/** \\brief  9020, Data Integrity Error Address Register */
#define CPU1_DIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIEAR*)0xF8839020u)

/** \\brief  9024, Data Integrity Error Trap Register */
#define CPU1_DIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_DIETR*)0xF8839024u)

/** \\brief  FD40, CPU Debug Monitor Start Address */
#define CPU1_DMS /*lint --e(923)*/ (*(volatile Ifx_CPU_DMS*)0xF883FD40u)

/** \\brief  C000, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C000u)

/** \\brief  C004, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C004u)

/** \\brief  C050, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR10_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C050u)

/** \\brief  C054, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR10_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C054u)

/** \\brief  C058, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR11_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C058u)

/** \\brief  C05C, CPU Data Protection Range, Upper Bound Register */
#define CPU1_DPR11_U /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_U*)0xF883C05Cu)

/** \\brief  C060, CPU Data Protection Range, Lower Bound Register */
#define CPU1_DPR12_L /*lint --e(923)*/ (*(volatile Ifx_CPU_DPR_L*)0xF883C060u)

