summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCpu_reg.h
/** \\brief  A014, CPU Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC2 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC2*)0xF883A014u)

/** \\brief  A018, Trapping Instruction Operand Register */
#define CPU1_FPU_TRAP_SRC3 /*lint --e(923)*/ (*(volatile Ifx_CPU_FPU_TRAP_SRC3*)0xF883A018u)

/** \\brief  FC08, Instruction Count */
#define CPU1_ICNT /*lint --e(923)*/ (*(volatile Ifx_CPU_ICNT*)0xF883FC08u)

/** \\brief  FE2C, Interrupt Control Register */
#define CPU1_ICR /*lint --e(923)*/ (*(volatile Ifx_CPU_ICR*)0xF883FE2Cu)

/** \\brief  FE28, Interrupt Stack Pointer */
#define CPU1_ISP /*lint --e(923)*/ (*(volatile Ifx_CPU_ISP*)0xF883FE28u)

/** \\brief  FE3C, Free CSA List Limit Pointer */
#define CPU1_LCX /*lint --e(923)*/ (*(volatile Ifx_CPU_LCX*)0xF883FE3Cu)

/** \\brief  FC0C, Multi-Count Register 1 */
#define CPU1_M1CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M1CNT*)0xF883FC0Cu)

/** \\brief  FC10, Multi-Count Register 2 */
#define CPU1_M2CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M2CNT*)0xF883FC10u)

/** \\brief  FC14, Multi-Count Register 3 */
#define CPU1_M3CNT /*lint --e(923)*/ (*(volatile Ifx_CPU_M3CNT*)0xF883FC14u)

/** \\brief  FE08, Program Counter */
#define CPU1_PC /*lint --e(923)*/ (*(volatile Ifx_CPU_PC*)0xF883FE08u)

/** \\brief  920C, Program Control 0 */
#define CPU1_PCON0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON0*)0xF883920Cu)

/** \\brief  9204, Program Control 1 */
#define CPU1_PCON1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON1*)0xF8839204u)

/** \\brief  9208, Program Control 2 */
#define CPU1_PCON2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PCON2*)0xF8839208u)

/** \\brief  FE00, Previous Context Information Register */
#define CPU1_PCXI /*lint --e(923)*/ (*(volatile Ifx_CPU_PCXI*)0xF883FE00u)

/** \\brief  9210, Program Integrity Error Address Register */
#define CPU1_PIEAR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIEAR*)0xF8839210u)

/** \\brief  9214, Program Integrity Error Trap Register */
#define CPU1_PIETR /*lint --e(923)*/ (*(volatile Ifx_CPU_PIETR*)0xF8839214u)

/** \\brief  8100, Data Access CacheabilityRegister */
#define CPU1_PMA0 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA0*)0xF8838100u)

/** \\brief  8104, Code Access CacheabilityRegister */
#define CPU1_PMA1 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA1*)0xF8838104u)

/** \\brief  8108, Peripheral Space Identifier register */
#define CPU1_PMA2 /*lint --e(923)*/ (*(volatile Ifx_CPU_PMA2*)0xF8838108u)

/** \\brief  9200, Program Synchronous Trap Register */
#define CPU1_PSTR /*lint --e(923)*/ (*(volatile Ifx_CPU_PSTR*)0xF8839200u)

/** \\brief  FE04, Program Status Word */
#define CPU1_PSW /*lint --e(923)*/ (*(volatile Ifx_CPU_PSW*)0xF883FE04u)

/** \\brief  1030, SRI Error Generation Register */
#define CPU1_SEGEN /*lint --e(923)*/ (*(volatile Ifx_CPU_SEGEN*)0xF8831030u)

/** \\brief  900C, SIST Mode Access Control Register */
#define CPU1_SMACON /*lint --e(923)*/ (*(volatile Ifx_CPU_SMACON*)0xF883900Cu)

/** \\brief  FD10, Software Debug Event */
#define CPU1_SWEVT /*lint --e(923)*/ (*(volatile Ifx_CPU_SWEVT*)0xF883FD10u)

/** \\brief  FE14, System Configuration Register */
#define CPU1_SYSCON /*lint --e(923)*/ (*(volatile Ifx_CPU_SYSCON*)0xF883FE14u)

/** \\brief  8004, CPU Task Address Space Identifier Register */
#define CPU1_TASK_ASI /*lint --e(923)*/ (*(volatile Ifx_CPU_TASK_ASI*)0xF8838004u)

/** \\brief  E400, CPU Temporal Protection System Control Register */
#define CPU1_TPS_CON /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_CON*)0xF883E400u)

/** \\brief  E404, CPU Temporal Protection System Timer Register */
#define CPU1_TPS_TIMER0 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF883E404u)

/** \\brief  E408, CPU Temporal Protection System Timer Register */
#define CPU1_TPS_TIMER1 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF883E408u)

/** \\brief  E40C, CPU Temporal Protection System Timer Register */
#define CPU1_TPS_TIMER2 /*lint --e(923)*/ (*(volatile Ifx_CPU_TPS_TIMER*)0xF883E40Cu)

/** \\brief  F004, Trigger Address */
#define CPU1_TR0_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F004u)

/** Alias (User Manual Name) for CPU1_TR0_ADR.
* To use register names with standard convension, please use CPU1_TR0_ADR.
*/
#define	CPU1_TR0ADR	(CPU1_TR0_ADR)

/** \\brief  F000, Trigger Event */
#define CPU1_TR0_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F000u)

/** Alias (User Manual Name) for CPU1_TR0_EVT.
* To use register names with standard convension, please use CPU1_TR0_EVT.
*/
#define	CPU1_TR0EVT	(CPU1_TR0_EVT)

/** \\brief  F00C, Trigger Address */
#define CPU1_TR1_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F00Cu)

/** Alias (User Manual Name) for CPU1_TR1_ADR.
* To use register names with standard convension, please use CPU1_TR1_ADR.
*/
#define	CPU1_TR1ADR	(CPU1_TR1_ADR)

/** \\brief  F008, Trigger Event */
#define CPU1_TR1_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F008u)

/** Alias (User Manual Name) for CPU1_TR1_EVT.
* To use register names with standard convension, please use CPU1_TR1_EVT.
*/
#define	CPU1_TR1EVT	(CPU1_TR1_EVT)

/** \\brief  F014, Trigger Address */
#define CPU1_TR2_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F014u)

/** Alias (User Manual Name) for CPU1_TR2_ADR.
* To use register names with standard convension, please use CPU1_TR2_ADR.
*/
#define	CPU1_TR2ADR	(CPU1_TR2_ADR)

/** \\brief  F010, Trigger Event */
#define CPU1_TR2_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F010u)

/** Alias (User Manual Name) for CPU1_TR2_EVT.
* To use register names with standard convension, please use CPU1_TR2_EVT.
*/
#define	CPU1_TR2EVT	(CPU1_TR2_EVT)

/** \\brief  F01C, Trigger Address */
#define CPU1_TR3_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F01Cu)

/** Alias (User Manual Name) for CPU1_TR3_ADR.
* To use register names with standard convension, please use CPU1_TR3_ADR.
*/
#define	CPU1_TR3ADR	(CPU1_TR3_ADR)

/** \\brief  F018, Trigger Event */
#define CPU1_TR3_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F018u)

/** Alias (User Manual Name) for CPU1_TR3_EVT.
* To use register names with standard convension, please use CPU1_TR3_EVT.
*/
#define	CPU1_TR3EVT	(CPU1_TR3_EVT)

/** \\brief  F024, Trigger Address */
#define CPU1_TR4_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F024u)

