summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCpu_reg.h
/** Alias (User Manual Name) for CPU1_TR4_ADR.
* To use register names with standard convension, please use CPU1_TR4_ADR.
*/
#define	CPU1_TR4ADR	(CPU1_TR4_ADR)

/** \\brief  F020, Trigger Event */
#define CPU1_TR4_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F020u)

/** Alias (User Manual Name) for CPU1_TR4_EVT.
* To use register names with standard convension, please use CPU1_TR4_EVT.
*/
#define	CPU1_TR4EVT	(CPU1_TR4_EVT)

/** \\brief  F02C, Trigger Address */
#define CPU1_TR5_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F02Cu)

/** Alias (User Manual Name) for CPU1_TR5_ADR.
* To use register names with standard convension, please use CPU1_TR5_ADR.
*/
#define	CPU1_TR5ADR	(CPU1_TR5_ADR)

/** \\brief  F028, Trigger Event */
#define CPU1_TR5_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F028u)

/** Alias (User Manual Name) for CPU1_TR5_EVT.
* To use register names with standard convension, please use CPU1_TR5_EVT.
*/
#define	CPU1_TR5EVT	(CPU1_TR5_EVT)

/** \\brief  F034, Trigger Address */
#define CPU1_TR6_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F034u)

/** Alias (User Manual Name) for CPU1_TR6_ADR.
* To use register names with standard convension, please use CPU1_TR6_ADR.
*/
#define	CPU1_TR6ADR	(CPU1_TR6_ADR)

/** \\brief  F030, Trigger Event */
#define CPU1_TR6_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F030u)

/** Alias (User Manual Name) for CPU1_TR6_EVT.
* To use register names with standard convension, please use CPU1_TR6_EVT.
*/
#define	CPU1_TR6EVT	(CPU1_TR6_EVT)

/** \\brief  F03C, Trigger Address */
#define CPU1_TR7_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F03Cu)

/** Alias (User Manual Name) for CPU1_TR7_ADR.
* To use register names with standard convension, please use CPU1_TR7_ADR.
*/
#define	CPU1_TR7ADR	(CPU1_TR7_ADR)

/** \\brief  F038, Trigger Event */
#define CPU1_TR7_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F038u)

/** Alias (User Manual Name) for CPU1_TR7_EVT.
* To use register names with standard convension, please use CPU1_TR7_EVT.
*/
#define	CPU1_TR7EVT	(CPU1_TR7_EVT)

/** \\brief  FD30, CPU Trigger Address x */
#define CPU1_TRIG_ACC /*lint --e(923)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF883FD30u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu
 * \{  */

/** \\brief  FF80, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A0 0xFF80

/** \\brief  FF84, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A1 0xFF84

/** \\brief  FFA8, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A10 0xFFA8

/** \\brief  FFAC, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A11 0xFFAC

/** \\brief  FFB0, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A12 0xFFB0

/** \\brief  FFB4, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A13 0xFFB4

/** \\brief  FFB8, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A14 0xFFB8

/** \\brief  FFBC, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A15 0xFFBC

/** \\brief  FF88, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A2 0xFF88

/** \\brief  FF8C, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A3 0xFF8C

/** \\brief  FF90, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A4 0xFF90

/** \\brief  FF94, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A5 0xFF94

/** \\brief  FF98, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A6 0xFF98

/** \\brief  FF9C, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A7 0xFF9C

/** \\brief  FFA0, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A8 0xFFA0

/** \\brief  FFA4, , type: Ifx_CPU_A, Address General Purpose Register */
#define CPU_A9 0xFFA4

/** \\brief  FE20, , type: Ifx_CPU_BIV, Base Interrupt Vector Table Pointer */
#define CPU_BIV 0xFE20

/** \\brief  FE24, , type: Ifx_CPU_BTV, Base Trap Vector Table Pointer */
#define CPU_BTV 0xFE24

/** \\brief  FC04, , type: Ifx_CPU_CCNT, CPU Clock Cycle Count */
#define CPU_CCNT 0xFC04

/** \\brief  FC00, , type: Ifx_CPU_CCTRL, Counter Control */
#define CPU_CCTRL 0xFC00

/** \\brief  9400, , type: Ifx_CPU_COMPAT, Compatibility Control Register */
#define CPU_COMPAT 0x9400

/** \\brief  FE1C, , type: Ifx_CPU_CORE_ID, CPU Core Identification Register */
#define CPU_CORE_ID 0xFE1C

/** \\brief  D000, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR0_L 0xD000

/** \\brief  D004, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR0_U 0xD004

/** \\brief  D008, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR1_L 0xD008

/** \\brief  D00C, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR1_U 0xD00C

/** \\brief  D010, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR2_L 0xD010

/** \\brief  D014, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR2_U 0xD014

/** \\brief  D018, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR3_L 0xD018

/** \\brief  D01C, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR3_U 0xD01C

/** \\brief  D020, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR4_L 0xD020

/** \\brief  D024, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR4_U 0xD024

/** \\brief  D028, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR5_L 0xD028

/** \\brief  D02C, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR5_U 0xD02C

/** \\brief  D030, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR6_L 0xD030

/** \\brief  D034, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR6_U 0xD034

/** \\brief  D038, , type: Ifx_CPU_CPR_L, CPU Code Protection Range Lower Bound
 * Register */
#define CPU_CPR7_L 0xD038

/** \\brief  D03C, , type: Ifx_CPU_CPR_U, CPU Code Protection Range Upper Bound
 * Register */
#define CPU_CPR7_U 0xD03C

