summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCpu_reg.h
/** \\brief  E020, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E020u)

/** \\brief  E024, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E024u)

/** \\brief  E038, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E038u)

/** \\brief  E03C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E03Cu)

/** \\brief  E030, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E030u)

/** \\brief  E034, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E034u)

/** \\brief  E048, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN4_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E048u)

/** \\brief  E04C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN4_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E04Cu)

/** \\brief  E040, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E040u)

/** \\brief  E044, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E044u)

/** \\brief  E058, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN5_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E058u)

/** \\brief  E05C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN5_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E05Cu)

/** \\brief  E050, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E050u)

/** \\brief  E054, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E054u)

/** \\brief  E068, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN6_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E068u)

/** \\brief  E06C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN6_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E06Cu)

/** \\brief  E060, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E060u)

/** \\brief  E064, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E064u)

/** \\brief  E078, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN7_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E078u)

/** \\brief  E07C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN7_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E07Cu)

/** \\brief  E070, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E070u)

/** \\brief  E074, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E074u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCPU_REG_H */
